_posts/2022-01-10-boj-11401.html
---
title: BOJ 11403 이항계수 3
tags: 수학
---

<div id="outline-container-orga456112" class="outline-2">
<h2 id="orga456112">BOJ 11401 이항계수 3</h2>
<div class="outline-text-2" id="text-orga456112">
<ul class="org-ul">
<li>N이 400만에서 이항계수 구하기</li>
<li>dp를 쓸 수 없음</li>
</ul>
</div>
</div>

<div id="outline-container-org3227779" class="outline-2">
<h2 id="org3227779">접근하기</h2>
<div class="outline-text-2" id="text-org3227779">
<ul class="org-ul">
<li>페르마의 소정리 이용</li>
</ul>
</div>
</div>

<div id="outline-container-org39d1d60" class="outline-2">
<h2 id="org39d1d60">코드</h2>
<div class="outline-text-2" id="text-org39d1d60">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>

<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">MOD</span> 1000000007
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">ll</span>;


<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #edd400; font-weight: bold;">factorial</span>(<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">num</span>)
{
        <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #ff6347;">ans</span> = 1;
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=2;i&lt;=num;i++) {
                ans = (ans * i) % MOD;
        }
        <span style="color: #729fcf; font-weight: bold;">return</span> ans;
}

<span style="color: #888a85;">// </span><span style="color: #888a85;">&#48516;&#54624;&#51221;&#48373; recursive&#47196; pow&#44396;&#54616;&#44592;</span>
<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #edd400; font-weight: bold;">pow</span>(<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">base</span>, <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">m</span>)
{
        <span style="color: #729fcf; font-weight: bold;">if</span> (m == 0 ) <span style="color: #729fcf; font-weight: bold;">return</span> 1;
        <span style="color: #729fcf; font-weight: bold;">if</span> (m == 1) <span style="color: #729fcf; font-weight: bold;">return</span> base % MOD;

        <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">half</span> = pow(base, m/2) % MOD;

        <span style="color: #729fcf; font-weight: bold;">if</span> (m %2 != 0) {
                <span style="color: #729fcf; font-weight: bold;">return</span> (half * half) % MOD * base % MOD;
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
                <span style="color: #729fcf; font-weight: bold;">return</span> (half * half) % MOD;
        }
}

<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">K</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%lld %lld"</span>, &amp;N, &amp;K);
        <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">ans</span> = factorial(N)%MOD * pow(factorial(K)%MOD * factorial(N-K)%MOD, MOD-2)%MOD;
        printf(<span style="color: #ad7fa8; font-style: italic;">"%lld\n"</span>, ans);
        <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc5d1171" class="outline-2">
<h2 id="orgc5d1171">문제 링크</h2>
<div class="outline-text-2" id="text-orgc5d1171">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/11401">https://www.acmicpc.net/problem/11401</a></li>
</ul>
</div>
</div>

<div id="outline-container-org960251c" class="outline-2">
<h2 id="org960251c">참고링크 (수학적 설명)</h2>
<div class="outline-text-2" id="text-org960251c">
<ul class="org-ul">
<li><a href="https://st-lab.tistory.com/241">https://st-lab.tistory.com/241</a></li>
</ul>
</div>
</div>
